In [63]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Read the dataset and general information about the dataset

In [64]:
df = pd.read_csv('./data/uber.csv')

In [65]:
df

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5
...,...,...,...,...,...,...,...,...,...
199995,42598914,2012-10-28 10:49:00.00000053,3.0,2012-10-28 10:49:00 UTC,-73.987042,40.739367,-73.986525,40.740297,1
199996,16382965,2014-03-14 01:09:00.0000008,7.5,2014-03-14 01:09:00 UTC,-73.984722,40.736837,-74.006672,40.739620,1
199997,27804658,2009-06-29 00:42:00.00000078,30.9,2009-06-29 00:42:00 UTC,-73.986017,40.756487,-73.858957,40.692588,2
199998,20259894,2015-05-20 14:56:25.0000004,14.5,2015-05-20 14:56:25 UTC,-73.997124,40.725452,-73.983215,40.695415,1
199999,11951496,2010-05-15 04:08:00.00000076,14.1,2010-05-15 04:08:00 UTC,-73.984395,40.720077,-73.985508,40.768793,1

In [66]:
df.shape

(200000, 9)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 9 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Unnamed: 0         200000 non-null  int64
 1   key                200000 non-null  object
 2   fare_amount        200000 non-null  float64
 3   pickup_datetime    200000 non-null  object
 4   pickup_longitude   200000 non-null  float64
 5   pickup_latitude    200000 non-null  float64
 6   dropoff_longitude  199999 non-null  float64
 7   dropoff_latitude   199999 non-null  float64
 8   passenger_count    200000 non-null  int64
dtypes: float64(5), int64(2), object(2)
memory usage: 13.7+ MB

In [68]:
df.isnull().sum()

Unnamed: 0           0
key                  0
fare_amount          0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    1
dropoff_latitude     1
passenger_count      0
dtype: int64

In [69]:
df = df.dropna()

In [70]:
df.isnull().sum()

Unnamed: 0           0
key                  0
fare_amount          0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    0
dropoff_latitude     0
passenger_count      0
dtype: int64

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 199999 entries, 0 to 199999
Data columns (total 9 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Unnamed: 0         199999 non-null  int64
 1   key                199999 non-null  object
 2   fare_amount        199999 non-null  float64
 3   pickup_datetime    199999 non-null  object
 4   pickup_longitude   199999 non-null  float64
 5   pickup_latitude    199999 non-null  float64
 6   dropoff_longitude  199999 non-null  float64
 7   dropoff_latitude   199999 non-null  float64
 8   passenger_count    199999 non-null  int64
dtypes: float64(5), int64(2), object(2)
memory usage: 15.3+ MB

In [72]:
df.describe()

,Unnamed: 0,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
count,1.999990e+05,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000
mean,2.771248e+07,11.359892,-72.527631,39.935881,-72.525292,39.923890,1.684543
std,1.601386e+07,9.901760,11.437815,7.720558,13.117408,6.794829,1.385995
min,1.000000e+00,-52.000000,-1340.648410,-74.015515,-3356.666300,-881.985513,0.000000
25%,1.382534e+07,6.000000,-73.992065,40.734796,-73.991407,40.733823,1.000000
50%,2.774524e+07,8.500000,-73.981823,40.752592,-73.980093,40.753042,1.000000
75%,4.155535e+07,12.500000,-73.967154,40.767158,-73.963658,40.768001,2.000000
max,5.542357e+07,499.000000,57.418457,1644.421482,1153.572603,872.697628,208.000000

In [73]:
df = df[
    (-180 < df['pickup_longitude']) & (df['pickup_longitude'] < 180) &
    (-180 < df['dropoff_longitude']) & (df['dropoff_longitude'] < 180) &
    (-90 < df['pickup_latitude']) & (df['pickup_latitude'] < 90) &
    (-90 < df['dropoff_latitude']) & (df['dropoff_latitude'] < 90) &
    (df['passenger_count'] < 50) & (df['passenger_count'] > 0) &
    (df['fare_amount'] > 0)
]
df.head()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5

In [74]:
df.shape

(199256, 9)

In [75]:
df.columns

Index(['Unnamed: 0', 'key', 'fare_amount', 'pickup_datetime',
       'pickup_longitude', 'pickup_latitude', 'dropoff_longitude',
       'dropoff_latitude', 'passenger_count'],
      dtype='object')

In [76]:
df['fare_amount'] = df['fare_amount'].astype(np.int64)

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 199256 entries, 0 to 199999
Data columns (total 9 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Unnamed: 0         199256 non-null  int64
 1   key                199256 non-null  object
 2   fare_amount        199256 non-null  int64
 3   pickup_datetime    199256 non-null  object
 4   pickup_longitude   199256 non-null  float64
 5   pickup_latitude    199256 non-null  float64
 6   dropoff_longitude  199256 non-null  float64
 7   dropoff_latitude   199256 non-null  float64
 8   passenger_count    199256 non-null  int64
dtypes: float64(4), int64(3), object(2)
memory usage: 15.2+ MB

## Formatting

In [78]:
df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime'])

In [79]:
df['pickup_datetime'].head()

0   2015-05-07 19:52:06+00:00
1   2009-07-17 20:04:56+00:00
2   2009-08-24 21:45:00+00:00
3   2009-06-26 08:22:21+00:00
4   2014-08-28 17:47:00+00:00
Name: pickup_datetime, dtype: datetime64[ns, UTC]

In [80]:
df['week_day'] = df['pickup_datetime'].dt.day_name()
df['Year'] = df['pickup_datetime'].dt.year
df['Month'] = df['pickup_datetime'].dt.month
df['Hour'] = df['pickup_datetime'].dt.hour

In [81]:
df = df.drop(['key', 'pickup_datetime', 'Unnamed: 0'], axis=1, errors='ignore')

In [82]:
df

,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,week_day,Year,Month,Hour
0,7,-73.999817,40.738354,-73.999512,40.723217,1,Thursday,2015,5,19
1,7,-73.994355,40.728225,-73.994710,40.750325,1,Friday,2009,7,20
2,12,-74.005043,40.740770,-73.962565,40.772647,1,Monday,2009,8,21
3,5,-73.976124,40.790844,-73.965316,40.803349,3,Friday,2009,6,8
4,16,-73.925023,40.744085,-73.973082,40.761247,5,Thursday,2014,8,17
...,...,...,...,...,...,...,...,...,...,...
199995,3,-73.987042,40.739367,-73.986525,40.740297,1,Sunday,2012,10,10
199996,7,-73.984722,40.736837,-74.006672,40.739620,1,Friday,2014,3,1
199997,30,-73.986017,40.756487,-73.858957,40.692588,2,Monday,2009,6,0
199998,14,-73.997124,40.725452,-73.983215,40.695415,1,Wednesday,2015,5,14
199999,14,-73.984395,40.720077,-73.985508,40.768793,1,Saturday,2010,5,4

In [83]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['week_day'] = le.fit_transform(df['week_day'])

## Train test split

In [84]:
X = df.iloc[:, 1:].values
y = df.iloc[:, 0:1].values

In [85]:
X

array([[ -73.99981689,   40.73835373,  -73.99951172, ..., 2015.        ,
           5.        ,   19.        ],
       [ -73.994355  ,   40.728225  ,  -73.99471   , ..., 2009.        ,
           7.        ,   20.        ],
       [ -74.005043  ,   40.74077   ,  -73.962565  , ..., 2009.        ,
           8.        ,   21.        ],
       ...,
       [ -73.986017  ,   40.756487  ,  -73.858957  , ..., 2009.        ,
           6.        ,    0.        ],
       [ -73.99712372,   40.72545242,  -73.98321533, ..., 2015.        ,
           5.        ,   14.        ],
       [ -73.984395  ,   40.720077  ,  -73.985508  , ..., 2010.        ,
           5.        ,    4.        ]])

In [86]:
y

array([[ 7],
       [ 7],
       [12],
       ...,
       [30],
       [14],
       [14]])

In [87]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [88]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

## Model Training

In [89]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
lr.fit(X_train, y_train)
y_pred = lr.predict(X_test)

In [90]:
from sklearn.metrics import mean_squared_error
r2 = lr.score(X_test, y_test)
RMSE = mean_squared_error(y_test, y_pred, squared=False)

In [91]:
print("r**2: ", r2)
print("RMSE: ", RMSE)

r**2:  0.018014272228515926
RMSE:  9.507366392745364

In [94]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators=10, random_state=0)
rfc.fit(X_train, y_train)
y_pred = rfc.predict(X_test)

/tmp/ipykernel_37439/420950825.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rfc.fit(X_train, y_train)

In [95]:
from sklearn.metrics import mean_squared_error
r2 = lr.score(X_test, y_test)
RMSE = mean_squared_error(y_test, y_pred, squared=False)

In [96]:
print("r**2: ", r2)
print("RMSE: ", RMSE)

r**2:  0.018014272228515926
RMSE:  5.486693821751538